{
  "source_metadata": {
    "content_id": "SuBHRfplzXY",
    "title": "True Epitome of a Team  < /dev/null |  The Her Hoop Stats Podcast",
    "platform": "YouTube",
    "channel_name": "Her Hoop Stats",
    "creator": "Her Hoop Stats",
    "publication_date": "2025-08-01T00:00:00+00:00",
    "duration_seconds": 2480,
    "url": "https://youtube.com/watch?v=SuBHRfplzXY",
    "metrics": {
      "views": 30,
      "likes": 1,
      "comments": 1,
      "channel_subscribers": 2810
    },
    "transcription_info": {
      "model_used": "base",
      "processing_time_seconds": 567.01992,
      "language": "en",
      "chunked": true,
      "quality_validated": true
    }
  },
  "transcript": "Hello everyone, it is August 1st. Friday August 1st, if you can believe it. I just barely can. I'm still kind of wrapping my head around it, but here we are. August, we're getting down the well into the second half of the WNBA season. We are getting some crazy playoff races of crazy implications. We will get into all that because we've got a game from last night, several games tonight that could have a lot to say about what we have going on here down the stretch later in the season. But before we get to that, I should say, I am, as always, JB Steyer Johnson alongside Brittany Carpher here on the Her Hoops stats podcast. And Brittany, man, I have so much I want to get to in the W. First of all, I do want to take a quick detour over to Afro Basket. And I want to give a shout out to South Sudan because anyone who watched the Olympics last year probably remembers how incredible the story it was for the South Sudan men's team to make the run that they did to qualify for the Olympics. I mean, a crazy young country, barely any resources within the country to really train basketball. It's been something that they're working on. They're really working on building up. They have some really great benefactors and some people that are working really hard to establish that within the country. And so the men's team qualifying for the Olympics last year, the women's team ended up getting a wildcard bid to Afro Basket this year. Had a tough pool play, had a really, really close game with second-ranked Bali and then lost their second game as well. And then they come in to bracket play in Arata Tehr, have one, two straight and are into the final four. So they will be playing in either the championship or the third-place game in their first ever Afro Basket. And some familiar names on the roster, notably Maria Gokdeg out of UNC, has been cleaning it up in their first round game, 24 rebounds, 12 offensive, 12 defensive, which I don't know that she ever had 24 to game. I would have to fact check it when she was at UNC. But it's what we saw at UNC, right? Like you have her in there, she's cleaning up the boards. Yep. So incredible performance there. And then you've got my girl, Nymyeo Doe, spent a year of Butler came over to Iowa State for three and then finished up at Colorado last year. Look, I knew that she had it. She's got crazy, crazy versatility. She worked really, really hard. And she's been lighted up for them. You've got Delicia Washington, who graduated a couple of years ago, played in the NCAA. You've got some very familiar names over the years from college teams. And so just, I mean, crazy, crazy cool for them to be representing like they are for such a young country showing, you know, hey, not only is basketball out here and a really great just thing to be involved in, you know, as far as community building, as far as something to do, but also showing the girls out there when not that long ago, it was pretty unheard of in South Sudan to be talking about like girls playing basketball, women playing basketball. And so just to see the pride that this team has in representing their country is really, really cool. And it's been great games and the environment there is awesome. Like they're drumming the whole time. The fans are super into it. So very, very fun to watch. I mean, the past to watch the entire tournament was like five books on court side. So highly recommend tuning in over the weekend if you haven't watched any games yet, especially because Saturday that we have what one WNBA games. So you can watch the semi finals and have a couple more games to watch. You've got to rematch with Molly for South Sudan where Cicacone will be out there. It'll be, it'll be really fun. It's a really cool environment. So just wanted to give a quick shout out there to South Sudan and their squad out there. A duplugac. She's like kind of the linchpin, the cornerstone. She's the most veteran player on the team. And she just, you just see everyone kind of turn to her. And she's been playing overseas, you know, for years now, played here in the US and college, but had to make sure I gave her like a by name shout out too, because that's like, that's that's kind of the emotional, the mental, the just the everything center of their team. So just really neat to see that. Yeah, I think that's why you love sports is a story like that. And so you kind of hit on all of it just, you know, for little girls and scene, what is possible now for such a young country that's really developing internationally, you know, it's just that's what makes sports fun is compelling stories like that. So for sure, if you have time to tune into the, you know, rest of the tournament, that would be definitely worth your viewing. Absolutely. And if you don't have time, at least go find the finish from yesterday's game because it was crazy. Like we're talking extremely last second full court pass for a buzzer beat like wild, very, very fun. All right, moving on here. Let's get back stateside last night, one game on the slate. And it was a good one. It was a close one. It was important. It was very, very fun. Valcrease at Mystics. And these are two teams that certainly outperforming the expectations that many people had for them by a pretty wide margin. I think it's two of the big front runners for coach of the year. And it, it really delivered. That's for sure. So Golden State coming away with the win, been really impressed with them since Kayla Thornton went out. I think that a lot of people said, well, that's your, that's your centerpiece. Like that's the person who's been there in every game, you know, when you've had this sort of rotating cast of players, KT's been there. She's been playing at, you know, the best level of her career. And a lot of people after she went out, it was like, well, oh, man, are they, are they going to be able to overcome that? You know, they've, they've dealt with so much. They've done really well. But that was their one piece of consistency. And the Valcrease and Natalie Nicosse and their whole program just keep demonstrating, hey, yeah, like this isn't one person. This is bigger than the individual. This is about our team as a whole. This is about our culture. And they're still right there in the hunt. So just, I mean, before we've been getting into the specific gameplay, really impressive to continue to do what they do when you have someone like Kayla Thornton go out. Yeah, Night and Night Out. We talked before about just what they show on the court is just their persistent, their tough, their, they're just kind of pesky. They're always around, you know, the way they guard, I think, Night and Night Out allows them to be in almost every game, you know, despite the game against the sun, you know, their first one without Kayla Thornton where they got kind of blown out. Now they've figured it out the last two games. And so I think, you know, just you can't say enough of what they've done as an expansion franchise and kind of the bar they're setting. I think, again, we've talked about kind of the collection of their roster. They've really taken a lot of pieces internationally. And then of course, that have been in the W as role players and they've all kind of bought into it. And it's just been really fun because I think what they are is just a true epitome of a team. And so every night you see that it's always someone else that stepping up leading the way. And that to me is just they've, they've really exceeded expectations. And they're going to be a team that I don't think will go away the last, you know, 17, 18 game stretch here. And doing what they did yesterday as well without Cheshire Zandall Sini playing without Modeak Billings, I mean, you talk about consistency in their program. You talk about experience in their program. That's the experience right there. And so really, really wild just to have that faith in your players, having so many different options, being able to find different ways to win. We keep talking about that. And against the team that is probably the most similar to them as far as having a lot of options, having that balance where you don't know exactly where anything is going to come from in Washington where you have, you know, Britney Sikes started off the season on a tear. And since then every other player has really stepped up in turn where you have your pair of All Star rookies in Sonya Satrana, Kiki, Erifen, you have Cheshire Austin who is showing exactly what she's capable of when she's healthy, reminding people, yeah, remember, I haven't been healthy. This is what I am capable of doing. And so you're going up against another team that is tough to game plan for because you can't just say, well, take this person out of it and they're really going to struggle, you know, they're very used to adjusting to that. They've played short-handed. They've made adjustments on the fly. And so I think that's part of what makes these matchups between these two teams specifically. So compelling. And then you look at the box scores and say, yep, they, uh, they share play similar in a lot of ways when you have 21 assists on 22 field goals made for golden state. First of all, that is absurd, absolutely absurd. And then you have 19 assists on 26 field goals made for Washington. It's like that both like on both ends in a game, especially, golden state is a very defensive minded team. So that says a lot about what Washington is capable of as far as moving the ball, making good decisions. And that's again, that's why this was such a tight game down the stretch because golden state built up a pretty good lead in the first half going in to the locker room up 12 on the road. And then you come out and Washington just chips away, chips away, chips away to the point where golden state scores six points in the fourth quarter still eeks out the win. But I mean, it took everything they had to come out of there with it because Washington simply refuses to go away. These are the two teams, I think, that absolutely refuse to go away. Yeah. And that's kind of been their story all year. You know, the, uh, Valkyries had that 30 point first quarter and then only scored 38 the rest, rest of the game. And so a true credit to the mistakes being able to stay in the game kind of grand that out. But I think what you saw, especially, you know, I think you can look at this game one or two ways as a basketball mind the last seven and a half minutes. I think there were only two field goals made. So of course, you're thinking, well, that could be bad offense. But I think too, it's a credit to both of their defenses. They were both very active made every shot you took difficult. And it's not like either team wasn't getting great looks. I just think they're very well defended books. And so, um, you know, I thought there was that back and forth. Uh, you know, I think the bench production for both teams, you had Lucy Olsen, Emily Angsler for the mistakes, give great production. And then on the Valkyries side, Kate Martin walked away their leading score was really a fishing game for her. And so, um, you know, I think both of those teams just always have players that stay ready. And that's a key, um, for both of them, it's because they have had kind of interchanging line-ups. They've had a lot of injuries, you know, they had things they've had to deal with. And they just always have players that stay ready. And so it's a, of course, you know, from the top down, I think for both of them, it's just really a testament again to the cultures that first year coaches have created there. And like you mentioned, a big gain for the Valkyries. Now they're two and oh, um, you know, over the mistakes. So when you're looking at kind of the playoff shuffling here, um, you know, they jumped up into that eight spot, I think with the tiebreaker now. And so, um, they have one more game out at Golden State, but you know, again, the Golden State have won that season series. So, um, when you're kind of shaking things out over the next 18 games, that was a very, very big win for the Valkyries on the room. And I mean, that's the other thing is you talk about the bench production. That, I mean, it's, it's the top to bottom production where you have four double digit scores for Golden State. But no one scores more than 14 points. That's crazy. You have a starter go scoreless in Tiffany Hage, just an off-knife I heard played less than 20 minutes. They, you know, again, it's Golden State. They're going to rotate people through. They're going to ride with what's working. And it's not going to be the same people every night. You had the TCME here come in with eight points and struggled from the floor, but went five to six from the free throw line. Like got the ones that you really need to. And then for Washington, the highest score in the entire game is Sony Citron. And she has 16 points. Like, this is not a high scoring game, but 68 to 67 isn't absurdly low scoring. So when you've got three double digit scores for Washington and the highest is 16. And then down the line, you have 8.7 point six points five point. Like you have everyone contributing. That's what is going to keep you in games. That's what's going to make you competitive. That's what is allowing these teams to kind of swing above the weight class that people were anticipating from them this season. And so I felt like this game was extremely indicative of their year as a whole. Definitely a little bit of a crazy ending with I think just some confusion, some miscommunication. Ultimately, the time that was left, I don't know how much difference it makes. But if you weren't watching Coach Sydney Johnson for Washington, trying to take a time out as they got the ball back with, I think under three seconds, wanted to take his reset time out. And wasn't acknowledged by the officials until time had ticked off. But then the argument is, well, he was calling time out, you know, the way coaches generally do, which is going for the shoulder, technically, if you're calling a reset time out, you are supposed to be motioning with the X. And so I don't know how much any of that really makes a difference. Ultimately, but it's interesting to see those kind of semantic things come into play. And first of all, you have to sit there like litigating it for ages and it screws with the pace of play. But in these are the kind of situations where I think that makes a little bit more sense when it's a new rule and it's a new coach that hasn't had to deal with that kind of thing before. But it's just one of those reminders, I guess, of how specific things need to be sometimes. Like I said, ultimately, I don't know how much of a difference it makes, but it's just another one of those. Well, okay, I guess that's something else we need to think about here down the stretch for our coach is like, okay, I guess I need to make the exact right gestures so that you, we talk about this in, you know, people use this kind of terrible. You want to be beyond reproach. Like if you do things completely by the book, then what's the argument if someone does miss you? Well, I did everything right. And so it's a tough lesson, I think, to learn, but also, it was an incredible comeback before that. I saw, I saw a great point online, which is like, if you're a mystics fan, why would you complain right now? Because you're getting to be competitive in these games, but ultimately if you lose, it improves your draft stock and you already have the best young core in the league, which like I, I think is so funny because I've been saying that like far in a way, it's the best young core in the league. And I, as someone who didn't grow up following pro sports at all, thinking about wins and losses in terms of draft stock is like such a foreign concept to me. And so I saw that I was like, oh yeah, that is, that is something, that is a way you could approach that said, I just thought that was kind of funny. It's like, hey, I can reason myself into anything being a good thing for me. That's a new one. And I love it. Like I just was sitting there, I'm like, okay, yeah. Yeah, definitely. I think it's fans. That's easy to do as players in a competitive environment. Oh yeah, definitely. Probably. You know, so like, that's a tough part about kind of where those teams are is you, you've done the work so far. And now you're at that point where you're on the cusp of a playoff. So now it's like, sure, people might want you to tank and might want you to lose games, but as a as a competitive person and you know, you're trying to get into the playoffs. And so that that was definitely a tough loss. I don't think, I mean, they ultimately were awarded the timeout. They still got a really good look from previous types. But as I know, the Valgris never, I mean, they should have just held the ball and got foul. So the turn, you know, so there was a little bit of learning. I think that is going missed on the Valgris side is I think Salon's on she's at the three point line with that rebound, trying to kind of make that pass inside. Thank Bentley. And it wasn't really necessary. You know, it was a risky pass. You're putting it where there's a lot of traffic. You know, and so the mistakes were fortunate enough to even be in that situation. And then I think ultimately too, they have to advantage when the turnover happened. And so as a coach, I think that's always that tough part. Do you call the timeout? Do you not? And so it would be interesting if Sydney Jocsson reflects back on that. And one, you know, kind of wish, hey, I should have just let the let the play happen because we're seconds. It was definitely a scramble situation. There was no way the Valgris were matched. Were they going to get the same type of look or even ultimately a better one than they got? You know, I think as a coach, that's always the hard part in those situations is, do you let it play out or do you ultimately use your reset? Get the look that, you know, you want. So they were so, you know, got a great look on that end. But I think again, if you go back and look, they definitely had the numbers and an advantage situation after the turnovers. So, but to your point, yes, there are, you know, nuances within.  coaching that you do need to be specific. So yes, maybe another second or two would have been awarded to them. I'd have to go back and even look at what the time was when they had the ball. But yeah, I think that ending was a really good one for a game that was very highly competitive. And I think that the ending for Golden State really illustrates, okay, yeah, we are still without Kiela Thornton and Monique Billings, like that experience there. And so like you said, very much a learning situation. And then I suppose, yeah, the bigger thing, the timeout's ultimately awarded, but the time that you're spending, figuring it out, the point of the reset timeout is that you shouldn't have time to game plan there. And so you are giving Golden State the opportunity to set up their defense, but not to huddle and figure it all out. And that kind of what they ended up getting because of that delay as the reviews happened. And so obviously the intent of the reset timeout was completely lost in that situation. And I think that that could have changed things as well. And as you say, you know, Shakira Austin had the ball. She's got a great arm on her. She has great vision. And so it really would be interesting to hear, okay? Going forward is that a situation that perhaps you would want to let play out or do you stick by wanting to draw things up? I know for me with a, again, a very young team that tends to just play on instinct more than anything else. I think that their team that is well set up to be able to succeed in that sort of scramble situation. But I mean, they've had great end of game sets prior as well. So totally there's not a right and wrong answer. It's just a very interesting sort of thought exercise, especially because as I said early in the episode, we're getting into well into the second half of the season. There's still a lot of games left. Like we still have 40% of the season left. So there's a lot to still figure out and develop as we go down the stretch here, and especially for a team, like the Mystics where they're now just one spot out of the playoffs in the craziest log jam. I've maybe every seen like the playoff race right now is absurd. I'm probably going to have to like sit down and map out the remaining schedule to even start figuring out what my predictions might be because first of all, the schedules are so unbalanced. But because you have Minnesota who's built up a pretty solid lead, like for a live game lead, when you're 28 games into the season, it's pretty dang impressive. But beyond that, I mean, it's a mess. Yeah, it really is. I mean, obviously the Liberty still have a little bit of a cushion at the second, but with their injuries, and with Brianna's door being out, probably the whole month of August, maybe not a return until the end, certainly with the dream and the storm on their heels, two losses back, I think that will be really interesting. And then from there, the log jam of all the other teams, and so that's why the sparks, if they're going to make any push, that's got to happen relatively soon. I think they're a team that they're just kind of all over the board. They look great one night. They're not so great the next, but the links obviously, like you said, in a really good position, but from there, yeah, I think we're just in for a really big treat the last 18 games of the season here with Playoff standings. And I mean, I always like to try to contextualize, right? For the links right now, they have five games ahead of the second place team, which is the Liberty. That means that their lead on the Liberty is greater than the distance between the Liberty and the Mystics. Mystics are nine and a half games back, which means they're four and a half games back for New York. That is crazy. Like, my mind just continues to be blue. We talk about how these specific head-to-head matchups have Playoff implications. We're talking major Playoff implications because this race is so tight. We are going to get into tiebreaker scenarios. Like, it's gonna be really, really difficult to avoid tiebreaker scenarios when you have eight teams within five games of each other at this point in the season. So games like last night, as you said, making sure that Golden State secures the season series over Washington, regardless of what happens in the next matchup, that really matters. Tonight, you have Phoenix playing Atlanta. You have LA going to Seattle, who's right there as well. So these games have major major implications. The big one for tonight, obviously being the Mercury and the Dream because, I mean, neck and neck, Mercury 16 and 10, Dream 16 and 11. Both of these teams have looked incredible at points and then struggled at points. The thing I'm really interested in tonight is what Phoenix changes from the last time these two teams saw each other because that was some of the best basketball we've seen out of Atlanta in a while was when they went up against Phoenix. And they are mostly back to full strength as far as their roster is concerned. Their injury report is clean. People are obviously still working their way back but they have all their weapons available in Phoenix. But they don't have maybe quite the level of comfort, the level of chemistry that they had developed with the group that had played more games together. And they're still figuring that out. The level of talent is crazy high, but the level of comfort, the level of the billiard is lower. So I'm very interested to see what they change, what they adjust from the last matchup because that was, I think a lot more lopsided than I was anticipating it looking. And I would be surprised if it's not a lot more competitive today. Yeah, I think that's a big thing with the Mercury right now is integrating everyone back in what their rotations look like, what they look like on the floor. I think the most disappointing thing for media tonight was their defensive effort against the Peeber. And I know Richard touched on it yesterday and the podcast as well with Cindy, but that's a major area of concern. They just looked really not interested on that into the floor. So no matter how talented they are offensively, they have to figure out some things defensively. But that, I think from a coaching standpoint, you're obviously relieved that you have the health that you have everyone back. But now it's, what does that look like? Will the chemistry come? Who's getting the shots? What's the ball movement look like? Those are the big things for the Mercury that I think they're obviously working through. So you like you said, yeah, it'll be interesting because I did not expect that game that happened in Phoenix the way it went. And then dream again, or a team that have kind of figured out how to play without players that are certainly very important to them. So a big game, I think Griner was ruled out tonight. So that I think helps the Mercury because I think that was a big thing the other night. They're still not great defending around the basket. And certainly when you have a player like Brittany Griner's capability out of the lineup that helps them. So, but again, just really will be interested to see the effort defensively for the Mercury because that was the thing that I thought was the big key the other night in the game against the fever, the intensity and the effort on that end of the floor was just not there. And I think that it's not like a hot take to say that one of the leading MVP candidates is going to be crucial in the game. But Alyssa Thomas has, she is so capable. She's capable of impacting the game at any given point in time. And there's so few players that can guard her well. And especially with Kali Akopper back with Satsu Sabli back, there's been too many times where it looks like she's looking to distribute or they're looking to get everyone involved. When I still believe that you need to be starting from a place of let's figure out what AT's role is in this game against this team, because maybe there's games where it's not her scoring a ton. Maybe it's more distributing, maybe it's more re-bounding and getting the ball at the floor. But there's no scenario in which you're playing your best as a team where it's Alyssa Thomas not being heavily involved. And so, especially against a fever, that was striking to me where the first few possessions Alyssa Thomas didn't touch the ball in offense. You had not terrible shots from Kali Akopper from Satsu Sabli, but it wasn't until nearly three minutes into the game that Alyssa Thomas got shot. And three minutes is three minutes, but it wasn't just not getting shots. It was that the ball wasn't in her hands. And that's not the way the Mert Greed should play. Like usually I couch it as, oh, you know, they're gonna make the decision. No, like this is one of the top MVP candidates in this league for a reason. And it's because of the way that she can impact the game in every facet. And so if you aren't starting out with the ball in her hands and say, okay, AT figure out where your advantages are, figure out what your matchup is. And then we go from there, especially she's the one who's been healthy more of the season. She has the rhythm. She has the familiarity. So it needs to be running through Alyssa Thomas to the rest of the team. And that's what's going to open things up. Her decision making is generally very, very good. And so I just wanna see a much more concerted effort from the jump to have AT establishing their offensive play, especially not having to rely on. Okay, I'm gonna make this defensive play and then I'm gonna get the, you know, steal and score or whatever. It's not about like the attitudes toward her or anything like that. Like she never seems bothered. You know, she wants her team to be involved. I think that a lot of the time it's that I want her to be more assertive. Like, right. It's the same thing that I say during the Iowa State season about Addy Brown, the same thing that said, I think about a lot of point forwards, specifically, is that they get, they really love the fact that they can do a lot of things. And especially the really good ones, it's, I love getting my teammates involved. And that I think is Alyssa Thomas, I think that really is a big thing with her. It's, she loves to be a distributor. She loves to get people good looks. There's times, girls, just put your head down and go to the basket. Like, there's not a person on the court that can guard you. And I just, I want to see her encourage to be more assertive. I want to see a little bit more of that focus on getting her going first from the mercury. And then the ball is going to get spread around. Like she will find you. Yeah. Yeah. I agree. I think it's just the trust in letting her figure out their identity for that giving game, you know? And that's why they were so successful early. And now that they've had everyone healthy, you're not seeing her impact it as much early in the game. And then it's kind of a few minutes so she finds a groove or get, you know, figures out. So like you said, yeah, be more assertive, run through her. And that's, that is why they've had success. And so if you're the mercury, you got to look back at the blueprint of what got you to where you were now. And then follow that even when you're healthy. And the teammates, I think, trust in what Alyssa Thomas is as a player and what she brings to the floor. So for the mercury, definitely going back to really letting her kind of, you know, be the one who navigates the game for them. That's the game that I definitely am really focused on. But it's, it'll be a very interesting slight top to bottom. Liberty have Wade J. Lingerad ahead of signing Emma Miesman. I would be very surprised if they set Miesman active a meat or if they have her available for the game immediately, they are playing at Connecticut and they are very short-handed. So as I say that, I actually would not be super surprised. I would be surprised if she is, she is in Connecticut with the team. I think so. Yeah. How many, if they have her available to play and if it does, how many minutes? I'll say, I would be surprised if she's playing like 30 minutes. Right. Yeah. I'd walk out there on the floor, just even to give other people a rest. But I don't think she's going to be like, OK, you're out on the floor and you just stay out there, even if it is Connecticut. I think that they probably are going to try to get her integrated a little bit more gently. Yeah, I guess now that I say it out loud, I wouldn't be shocked because they are just so short-handed. It would probably be good just to have any kind of body. So that'll be obviously crazy interesting to see. Fever and wings, wings have been this close. And in a couple of really big games, I continue to be intrigued by them. As we said, sparks and storm obviously have significant implications. So there are a couple teams that have been about as up and down as you can be. Still don't really know what to make of the storm because they can be so good and then they can struggle. Well, both of those. Both of those starting five. It's beyond that. You have no idea what you're getting either night from either team. And so they are the roller coaster of teams this year. I think we both have talked how we want to be high on them. And then it's one step forward and then five steps back. It's not even like two. It's like, oh, wow, that was not the team I thought they were. So those two, yeah, that is an interesting game. The sparks are kind of in a position where they can afford to really drop too many more games if they still want to be realistically in the playoff hunt. Like you were just going to say, can bring theme back definitely helps that team. Hopefully maybe a little bit more spark defensively for them as a rim protector. But again, yeah, that game is intriguing just because you have no idea what you're going to get. So beyond maybe the starting five being really good for both of them, it's just a crap shoot after that. Yeah, no kidding. And then for Cambrink, I mean, it's fun to see her go up against players like, I mean, as he magba Gore is about as similar of a player in the league to Cam as there is. And so I'm really excited for that matchup. Both have the ability to really protect the rim, stretch the floor, do a lot of things well. So I think that'll be very, very fun for the minutes when we get that. And then the fifth game of the night, earlier in the night, Valkyries in the sky, Valkyries going back to back, going to a sky team that still, as a pretty lengthy injury report, again, just really hard to know what you're going to get on any given night. Valkyries have a system, but also don't have a ton in the post. Ilyana Repair's edition should really help them against the team like the sky, where they do have a significant presence inside. So that's kind of the thing I'll be watching for is to see what Repair can bring, because again, this is a sky tee that really runs through the interior. Yeah, I, that game, I think just too off of back to back in a pretty hard fought game against the Mystic. So the sky certainly have a little rest, but with the, with the injury report they've had, they've just been so hard to know kind of what they're going to be. And you know, they say all the right things, but it's just without, especially Angel Reese, who does so much for them on both ends of the floor, they're just an entirely different team without her. So I think going to be a hard game for this guy, just because the Valkyries have been so good in what they do, you know, collectively, that it always seems like they have enough pieces that, you know, will push them kind of to the top there. Yeah, it's, it's an interesting slate. It'll be, it'll be something to try to follow all of them with I said I wasn't going to harp on it, but four games tipping off at the same time. Yeah, not ideal. Decisions made. It's something, but they'll be very fun games. There'll be plenty to watch back and look at later for sure. And just like we said, a lot of really, really consequential basketball. So plenty to enjoy this evening going forward into this weekend. I noted I will be going to the Mercury Sky game on Sunday. We're taking a family up there. So I'm looking forward to seeing the Mercury for sure in person. And then obviously I'm really fingers crossed that Angel will be healthy for the, the sky to see her live too. So, oh, that'll be super fun. Yeah, fingers crossed for you. Very, very much hoping that you get a healthy game and a great game there. Oh, I'm excited to hear about it next week. All right. Decadent, of course, excited because he, he loves Colony Brown for the Mercury. And I'm like, well, buddy, she's not playing a whole lot right now, but you know, he always picks the most random players. So he, of course, is just excited because it's a WMBA game. So I will be really excited to hear what his big takeaways were because I'm sure he'll come away with another player or three that he wants a jersey from. Absolutely. Yes, yes. Amazing. Okay. Well, folks, as always, you can follow us online, follow Pretty Carpour at Pretty Carpour. I am at J-Styles J-S-T-E-Y-Z. And of course, make sure you are following her hoop stats. They are at her hoop stats on all of those social platforms. You also can subscribe to our newsletter. We send out a whole bunch of terrific written content nearly daily. And then you can subscribe to the podcast if you are not already wherever you're listening or watching. Like, subscribe, share with your friends. All of that is obviously extremely, extremely appreciated. Thanks for sticking with us for another week here on the her hoop stats podcast. And we will be back Monday."
}